import 'package:flutter/material.dart';

class NamePredictionPage extends StatefulWidget {
  @override
  _NamePredictionPageState createState() => _NamePredictionPageState();
}

class _NamePredictionPageState extends State<NamePredictionPage> {
  final _controller = TextEditingController();
  String _fortune = '';

  void _getFortune() {
    setState(() {
      _fortune = _calculateNapoleonFortune(_controller.text);
    });
  }

  String _calculateNapoleonFortune(String name) {
    if (name.isEmpty) return 'សូមបញ្ចូលឈ្មោះជាមុនសិន!';

    // Convert name to uppercase and remove any non-alphabet characters
    name = name.toUpperCase().replaceAll(RegExp(r'[^A-Z]'), '');

    int sum = 0;
    for (int i = 0; i < name.length; i++) {
      sum += (name.codeUnitAt(i) - 64); // 'A' is 1, 'B' is 2, ..., 'Z' is 26
    }

    // Reduce sum to a single digit
    while (sum > 9) {
      sum = sum.toString().split('').map(int.parse).reduce((a, b) => a + b);
    }

    return _getFortuneText(sum);
  }

  String _getFortuneText(int number) {
    switch (number) {
      case 1:
        return "មនុស្សជំពូកលេខ ១\n"
            "លក្ខណៈសម្បត្តិ\n"
            "សម្បូរដោយសេចក្ដីក្លាហាន និង គំនិតផ្សងព្រេង គំនិតអារកាត់ខ្លាំង ឯកច្ឆន្ទ ។ ជាទូទៅ​ច្រើនប្រកបដោយ​ការឆ្មើងឆ្មៃ​យ៉ាងមាំទាំ និង ថាមពលខាងចរិយា​ដ៏ធំ​ចំពោះ​សត្រូវ ។ ​ជាមនុស្ស​កើតមក​សម្រាប់​​ធ្វើជា​មេគេ​ ឬក៏​ជាអ្នកល្បីល្បាញ បើប្រសិនជា​គ្មានកាលៈទេសៈ​អ្វីមក​ខ្ទាស់​ការរីកចំរើន​ខាងផ្លូវគំនិត​របស់គេ​ទេ ។\n"
            "បុគ្គលភាព\n"
            "ជា​មនុស្ស​មាន​គំនិត​ថ្លៃថ្នូរ​ ហើយ​ខ្ពង់ខ្ពស់​ព្រមទាំង​ប្រកប​ដោយ​ប្រាជ្ញា​ឈ្លាសវៃ ប្លែក​ពីគេ ។ ជា​អ្នក​តែង​ធ្វើ​ឱ្យ​គេ​ចាប់​អារម្មណ៍​មក​លើ​ខ្លួន ហើយ​ច្រើន​កាន់កាប់ មុខងារ​ធំ​ដុំ​នៅ​កន្លែង​ធ្វើការ​ ។ ដោយ​ហេតុ​ជនជំពូក​លេខ​១​នេះ​មាន​បុគ្គល​ភាព ត្រចះត្រចង់​ជន​នេះ​ក៏​ក្លាយ​ជា​អ្នកមាន​វាសនា​ខាងធ្វើ​អោយមាន​អ្នក​កោត​សរសើរ​ខ្លួន​ច្រើន មិត្ដ​ភក្ដិ​ក៏​ច្រើន​ តែ​សត្រូវ​ក៏​ច្រើន​ដែរ​ ។\n"
            "ស្នេហា និង អាពាហ៏ពិពាហ៏\n"
            "ជនជំពូក​លេខ ១ មាន​ទំនោរ​ចិត្ដ​ជា​អ្នក​ត្រួតត្រា​ហើយ​ចូលចិត្ដ​បញ្ជា​លើ​មនុស្ស​ដែល​ខ្លួន​ជ្រើសរើស​ជា​គូគាប់​ណាស់​ ។ ​ច្រើន​មាន​ចិត្ដ​ប្រច័ណ្ឌ​មិនព្រម​ឱ្យ​គូគាប់​ របស់​ខ្លួន​មាន​ចិត្ដ​វៀច​វេរ​ទេ ។ បើ​រៀបការ​ជា​មួយ​មនុស្ស​ជំពូក​លេខ​២ និង លេខ​៦ ទើប​ល្អ​ ។ មិនសូវ​ល្អ​ជាមួយ​នឹង​៥ ឬ​លេខ​៧ ព្រោះ​ច្រើន​ទាស់ទែង​គ្នា​ ។\n"
            "ការងារ និង ទំនាក់ទំនង\n"
            "ជា​មនុស្ស​ដែល​កើត​មក​សម្រាប់​តែ​បាន​ទទួល​ជោគជ័យ​ក្នុង​អ្វីៗ​ដែល​ខ្លួន​កាន់កាប់​ ។ ថ្វី​បើ​គេ​ជា​អ្នកមាន​គំនិត​ខាង​ការ​បង្កើត ហើយ​ពិចារ​ណា​ច្រើន​ក្ដី មនុស្ស​ជំពូក​លេខ​១ ធ្វើការ​ក្នុង​រដ្ឋបាល​ក៏​ពូកែ រត់​ការ​ក៏​ពូកែ​ ។ តែ​ទោះ​ជា​ធ្វើការ​អ្វី​ក៏ ដោយ​មនុស្ស​នេះ​ត្រូវ​កាន់កាប់​ការ​នោះ​តែ​ម្នាក់​ឯង ឬ​ធ្វើ​ជា​មេ​គេ​ទើប​ស្រប តាម​វាសនា​របស់​គេ​ ។ តាមពិតទៅ ថ្វី​បើ​គេ​ជា​អ្នក​ធ្វើការ​ដោយ​ស្វិត​ស្វាញ និង មនសិការ មនុស្ស​ជំពូក​លេខ​១​មិន​ចូលចិត្ដ​ស្ថិត​នៅក្រោម​ឱវាទ​គេ​ទេ​ ។ ក្នុងទំនាក់ទំនង​ជា​មួយ​ចៅហ្វាយ​នាយ​របស់​ខ្លួន មនុស្ស​ជំពូក​លេខ​១​ច្រើន​ចូលចិត្ដ​កាត់​ណាស់​ ។\n"
            "លុយកាក់ និង ទ្រព្យសម្បត្តិ\n"
            "មនុស្ស​ជំពូក​លេខ​១​ប្រសប់​ប្រកប​របរ​ណាស់​ហើយ​តែង​រក​ចំណេញ​បាន​ច្រើន​ផង ​។ តែ​ជា​អកុសល​រក​បាន​ប៉ុន្មាន ចាយ​អស់​ប៉ុណ្ណឹង បើ​និយាយ​ឱ្យ​ខ្លី គឺ​រក​ក៏​ធូរ ចាយ​ក៏​ធូរ​ ។";

      case 2:
        return "មនុស្សជំពូកលេខ ២\n"
            "លក្ខណៈសម្បត្តិ\n"
            "មាន​ចរិត​ជា​អ្នក​ឆាប់​រំភើប​បំផុត​ឆាប់ខឹង តែ​ចូល​ចិត្ដ​គោរព​អ្នក​ដទៃ​ ។ ជា​អ្នក​ចេះ​ស្ដាប់​បង្គាប់ ចូល​ចិត្ដ​ឱ្យ​គេ​ដឹកនាំ​ជាជាង​បញ្ជា​គេ​ ។ មនុស្ស​ជំពូក​នេះ​ ពេញចិត្ដ​នឹង​ការ​រាក់ទាក់​រាប់អាន​ណាស់ ហើយ​តែង​តែ​ខិតខំ​បំពេញ​បំណង​ជន​ដែល​មក​សុំ​ជំនួយ​ពី​ខ្លួន​ ។\n"
            "បុគ្គលភាព\n"
            "ដោយ​ខ្លួន​ជា​អ្នក​រាក់ទាក់​មនោសញ្ចេតនា ចូលចិត្ដ​និយាយ​រឿង​ផ្ទាល់ខ្លួន ប្រាប់​គេ មនុស្ស​ជំពូក​លេខ​២ តែង​បណ្ដោយ​ខ្លួន​ទៅ​តាម​ទឹកចិត្ដ ជា​ជាង​ទៅតាម​វិចារណញ្ញាណ នៅ​ពេល​ខ្លួន​ក្ដាប់​ស្ថានការណ៍​បាន​ហើយ​ក្ដី ក៏​មនុស្ស​ជំពូក​លេខ​២ តែងតែ​នៅ​មាន​ការ​រំភើប​ជានិច្ច​នៅ​ពេល​ដែល​ខ្លួន​ជួបប្រទះ​នឹង​ការ​លំបាក ។ ដោយ​ខ្លួន​មិន​សូវចេះ​រស់​ក្នុង​ជីវភាព​សង្គម មនុស្ស​នេះ​ចូល​ចិត្ដ​រស់​នៅ​តែ​ឯក​ឯង ព្រោះ​ស្អប់​បរិយាកាស​អាប់​អួរ​ណាស់​ ។\n"
            "ស្នេហា និង អាពាហ៏ពិពាហ៏\n"
            "មនុស្ស​ជំពូក​លេខ​២ ច្រើន​ជា​ស្វាមី​ឬ​ភរិយា​គ្រប់​លក្ខណ៍​ ។ ការ​ពិត​មនុស្ស​ជំពូក​នេះ​ដោយ​អាស្រ័យ​លើ​ទឹក​ចិត្ដ​សណ្ដោស​និង​មនោសញ្ចេតនា​របស់​ខ្លួន តែង​ប្រឹងប្រែង​ផ្ដល់​ឱ្យ​គូគាប់​របស់​ខ្លួន​នូវ​សុខុមាលភាព​និង​សុភមង្គល​ ។ មាន​ពេល​ខ្លះ ទោះជា​នៅ​ចំពោះមុខ​សីលធម៌​ឬ​ក៏​ប្រាកដនិយម​ដែល​ជា​ការ​ចាំបាច់​សម្រាប់​ការ​រស់​នៅ​ក្ដី ក៏​មនុស្ស​ជំពូក​នេះ​មិន​ចោល​ភាព​អណ្ដែត​អណ្ដូង​របស់​ខ្លួន​ដែរ​ ។ បើ​រៀបការ​ជា​មួយ​មនុស្ស​ជំពូក​លេខ​៤ និង​លេខ​៦ ទើប​ល្អ​ ។ តែ​ជា​មួយ​លេខ​៨ និង​លេខ​៩ ក៏​ល្អ​ដែរ ព្រោះមាន​លក្ខណៈ​ប្រហែល​គ្នា​ ។\n"
            "ការងារ និង ទំនាក់ទំនង\n"
            "ជា​មនុស្ស​គិត​ច្រើន​និង​មាន​គំនិត​បង្កើត តែ​កង្វះ​ខាង​ភាព​ឈ្លានពាន​របស់​មនុស្ស​នេះ តែង​នាំ​ឱ្យ​មនុស្ស​ជំពូក​នេះ​ចូល​ចិត្ដ​ធ្វើ​ជា​ចិត្ដវិទូ​ជា​ឧបការី​សង្គម​និង​ជា​លេខាធិការ​ដ៏​មាន​ប្រសិទ្ធភាព​ ។ ​សរុប​សេចក្ដី​ទៅ​គឺ​ជា​មនុស្ស​ដែល​កើត​មក​សម្រាប់តែ​ទទួល​ជោគជ័យ​ក្នុង​វិជ្ជាជីវៈ​ណា​ដែល​តម្រូវ​ឱ្យ​មាន​មនសិការវិជ្ជា ជីវៈ​និង​ការ​ឱហាត​ក្នុង​កិច្ចការ​ ។\n"
            "លុយកាក់ និង ទ្រព្យសម្បត្តិ\n"
            "ជា​អ្នក​សន្សំ​ប្រាក់​ផុតលេខ​ហើយ​មិន​ចូលចិត្ដ​ខាត​បង់​លុយកាក់​ទទេៗ​ក្នុង​មុខរបរ​មាន​គ្រោះថ្នាក់​ឬ​មិន​ជាក់ច្បាស់​ឡើយ​។ គឺ​ចូល​ចិត្ដ​យក​លុយ​ទៅ​រកស៊ី​ដោយ​មាន​បែបផែន ហើយ​មិន​ចូលចិត្ដ​លេង​ល្បែង​ស៊ីសង​ទេ ​។ ប៉ុន្ដែ​ដោយ​ខ្លួន​ជា​អ្នក​ចិត្ដ​ល្អ​ពី​ធម្មជាតិ​មក នោះ​មនុស្ស​ជំពូក​នេះ​ហ៊ាន​ចំណាយ​ទៅ​លើ​មនុស្ស​ដែល​ខ្លួន​ស្រឡាញ់​ដោយ​ឥឥត​ញញើត​ដៃ​ទេ ។";

      case 3:
        return "មនុស្សជំពូកលេខ ៣\n"
            "លក្ខណៈសម្បត្តិ\n"
            "ជា​មនុស្ស​ពោរពេញ​ដោយ​ថាមពល​និង​គំនិត​បង្កើត ស្រឡាញ់​ជីវភាព​តាម​គ្រប់​លក្ខណៈ ហើយ​អ្វី​ក៏​អាច​ទាក់​ចិត្ដ​គេ​បាន​ដែរ​ ។ ជា​អ្នក​សុទិដ្ឋិនិយម និង ទុក​ចិត្ដ​ខ្លួនឯង ។ ចេះ​ភ្លក់​រសជាតិ​នៃ​ការ​សប្បាយ​នៃ​ជីវិត​ហើយ​ចេះ​ទទួល​ទិដ្ឋិភាព​ជា​វិជ្ជមាន​ក៏​ដូចជា​ទិដ្ឋិភាព​មិន​សូវ​សប្បាយ​ដែរ ។ រហ័សរហួន ហើយ​ឆាប់​ទទួល​ឥទ្ធិពល​ពី​គេ ដូច​មនុស្ស​ឯ​ទៀត​ដែរ ​តែ​ក៏​ឆាប់​ជួប​នឹង​វិបត្ដិ​ផ្លូវ​ចិត្ដ​ដែរ ។\n"
            "បុគ្គលភាព\n"
            "ចូល​ចំណោម​ឆាប់​ចុះ​រហូត​ដល់​គេ​អាច​និយាយ​បាន​ថា​មនុស្ស​ជំពូក​លេខ​៣​នេះ​គឺ​ជា​មនុស្ស​ងាយ​សម្រប​តាម​ជីវភាព​ក្នុង​សហគមន៍​បំផុត ​។ ជា​អ្នក​ចេះ​ទប់​ចិត្ដ​បាន​យ៉ាង​ត្រចះត្រចង់​ហើយ​យ៉ាង​សប្បាយ​ទៀត​រួច​ចេះ​ធ្វើ​ឱ្យ​អ្នក​ផង​ពេញ​ចិត្ដ​គ្រប់ៗ​គ្នា​ ។ អ៊ីចឹង​ហើយ​បាន​ជា​មនុស្ស​នេះ​ងាយ​រក​មិត្ដភាព​ពី​អ្នក​ដទៃ​ណាស់​ ។ បាន​ជា​ឆាប់​ទទួល​ការ​រាប់អាន​ដូច្នេះ​ព្រោះ​មនុស្ស​ជំពូក​លេខ​៣​មិន​ចូលចិត្ដ​ចោទ​បញ្ហា​ច្រើន​ទេ​ព្រោះ​ខ្លាច​ការ​រស់​នៅ​ដោយ​សប្បាយ​ឆាប់​បាត់​បង់​ទៅ​វិញ ដូច​ដែល​ខ្លួន​ងាយ​រក​បាន​មក ។\n"
            "ស្នេហា និង អាពាហ៏ពិពាហ៏\n"
            "ថ្វីបើ​មនុស្ស​ជំពូក​លេខ​៣​ជា​អ្នក​មាន​ទឹក​ចិត្ដ​ទោរ​ទន់​ក៏​ដោយ ក៏​នៅ​មុន​ពេល​រក​គូ​ស្រករ មនុស្ស​នេះ​ចូលចិត្ដ​ធ្វើ​ពិសោធន៍​ចិត្ដ​គូគាប់​របស់​ខ្លួន​មុន​ជានិច្ច​ ។ លុះ​រៀបការ​ហើយ​មនុស្ស​នេះ​តែង​ខិតខំ​បំពេញ​ចិត្ដ​គូគាប់​និង​កូនចៅ​របស់​ខ្លួន​ណាស់​ ។ យក​ល្អ​ត្រូវ​រៀបការ​នឹង​មនុស្ស​ជំពូក​លេខ​៣​ដូចគ្នា និង​លេខ​៨ ។\n"
            "ការងារ និង ទំនាក់ទំនង\n"
            "ដោយ​មាន​ការ​រហ័សរហួន និង​គំនិត​ផ្ដើម​ពី​ធម្មជាតិ​មក​ស្រាប់ មនុស្ស​នេះ​ចូលចិត្ដ​ប្រកប​របរ​ណា​ដែល​ខ្លួន​អាច​បង្ហាញ​ឱ្យ​ឃើញ​នូវ​ការ​ប៉ិនប្រសប់ និង​គំនិត​ផ្ដួច​ផ្ដើម​របស់​ខ្លួន​ណាស់​ ។ បើ​ធ្វើ​ជា​អ្នក​កាសែត អ្នកថតរូប​វិចិត្រករ គឺ​ប្រសើរ​ណាស់ ព្រោះ​អាច​បាន​ទទួល​ជោគជ័យ​ច្រើន​ ។ ម្យ៉ាង​ទៀត មុខ​របរ​ខាង​ការ​ផ្សាយ​ខាង​ទំនាក់ទំនង​សាធារណៈ ពោល​ឱ្យ​ខ្លី​ គឺ​ឱ្យ​តែ​មុខ​របរ​ណា​មាន​ទំនាក់ទំនង​នឹង​មនុស្ស​ដទៃ​ច្រើន មនុស្ស​ជំពូក​លេខ​៣ ប្រសប់​ធ្វើ​ឱ្យ​បាន​ជោគជ័យ​បំផុត ។\n"
            "លុយកាក់ និង ទ្រព្យសម្បត្តិ\n"
            "ជា​មនុស្ស​ចិត្ដ​ល្អ​ហើយ​ចាយ​ធំ​ផង​ ។ ចូលចិត្ដ​ធ្វើ​ម៉េច​ឱ្យ​តែ​អ្នក​មក​ជួប​នឹង​ខ្លួន​បាន​សប្បាយ​ចង់​អស់​ប៉ុន្មាន​ក៏​អស់​ទៅ ព្រោះ​ចូលចិត្ដ​គិតថា លុយ​មិនមែន​ធ្វើ​មក​សម្រាប់​តែ​សន្សំ តែ​សម្រាប់​ចាយ​ឱ្យ​បាន​សប្បាយ​ចិត្ដ ។";

      case 4:
        return "មនុស្សជំពូកលេខ ៤\n"
            "លក្ខណៈសម្បត្តិ\n"
            "ជា​អ្នក​ធ្វើ​ការ​មិន​ខ្លាច​នឿយហត់​ប្រកប​ដោយ​គំនិតម៉ឺ​ងម៉ាត់​និង​ប្រាកដ​និយម​ ។ មនុស្ស​ជំពូក​លេខ​៤​ស្រឡាញ់​វិជ្ជាជីវៈ​របស់​ខ្លួន​ណាស់​ ។ ជា​ទូទៅ ដោយអាស្រ័យ​លើ​គុណសម្បត្ដិ​ពិសេស​របស់​ខ្លួន​ជា​អ្នក​រៀបចំ និង​ដឹកនាំ មនុស្សនេះ ច្រើន​ទទួល​ជោគជ័យ​ជា​និច្ច​ក្នុង​កិច្ចការ​ ។ គុណសម្បត្ដិ​ពិសេស​របស់​មនុស្ស​ជំពូក​លេខ​៤​គឺមនៈសិការ​ក្នុង​វិជ្ជាជីវៈ ការ​ទៀងទាត់ និង​ការឱហាត\n"
            "បុគ្គលភាព\n"
            "ជា​អ្នក​ប្រយ័ត្ន​ប្រយែង ហើយ​គត់មត់​ ។ មិន​ងាយ​ប្រព្រឹត្ឍ​អំពើ​ផ្ដេសផ្ដាស​ទេ ព្រោះ​ជា​មនុស្ស​មាន​ស្មារតី​ម៉ឺម៉ាត់ មិន​ចេះ​រវើរវាយ​ ។ គឺ​ជា​មិត្ដ​ភក្ដិ​ដ៏​ប្រសើរ ខាង​ស្មោះត្រង់​បំផុត​តែ​មិន​ពូកែ​ខាង​ប្រើ​ទឹកមុខ​ទេ​ហើយ​ឆាប់​ខឹង​ណាស់​ ។ បើ​នឹង​ជឿ​លើ​រឿង​អ្វី​មួយ​គឺ​ទាល់​តែ​ពិចារណា​ហ្មត់ចត់​ណាស់​តែ​បើ​ទុកចិត្ដ​ហើយ​ទោះ​ត្រូវ​ធ្វើ​អ្វី​ក៏​ធ្វើ​ដែរ ឱ្យ​តែ​មនុស្ស​ដែល​ខ្លួន​ស្រឡាញ់​នោះ​បាន​ពេញ​ចិត្ដ​ ។\n"
            "ស្នេហា និង អាពាហ៏ពិពាហ៏\n"
            "មនុស្ស​ជំពូក​លេខ​៤ មិន​ងាយ​ចាប់​ចិត្ដ​ស្រឡាញ់​គេងាយៗ​ទេ ហើយ​បើ​នឹង​រៀបការ​ជា​មួយ​អ្នក​ណា​ម្នាក់​វិញ ទាល់​តែ​បាន​សង្កេត​មើល​ចិត្ដ​ថ្លើម​អស់​ចិត្ដ​អស់ចង់​ ។ គឺ​ជា​ភរិយា​ឬ​ស្វាមី​ដ៏​ប្រសើរ​ប្រកប​ដោយ​គំនិត​ទទួល​ខុសត្រូវ និង​សីលធម៌​ ។ និយាយ​ឱ្យ​ខ្លី​ទៅ​បើ​លោក​អ្នក​ចង់​រក​គូ​ស្រករ​ជា​អ្នក​រវើរវាយ​ហើយ​ល្ងង់ខ្លៅ​សូម​កុំ​យក​មនុស្ស​ជំពូក​លេខ​៤​នេះ​ឱ្យ​សោះ ។ មនុស្ស​នេះ បើ​រៀបការ​ជាមួយ​នឹង មនុស្ស​ជំពូក​លេខ​៤, ៧ និង ៩ គឺ​ប្រសើរ​ណាស់ ព្រោះ​រវាង​គ្នា​នឹង​គ្នា មាន​ភាពស្រប​ខាង​ប្រាជ្ញា​ច្រើន​ណាស់​ ។\n"
            "ការងារ និង ទំនាក់ទំនង\n"
            "ដោយ​មាន​ធម្មជាតិ​ជា​អ្នក​ស្រឡាញ់​ការ​សិក្សា​មនុស្ស​ជំពូក​លេខ​៤​មាន​និស្ស័យ​ខាង​កិច្ចការ​ណា​ដែល​មាន​ទ្រឹស្ដី ជា​អាទ៍​ ។ គេ​ច្រើន​ជា​គណិត​វិទូ​អ្នក​ស្រាវជ្រាវ វិស្វករ និង​សាស្ដ្រាចារ្យ​ ។ ជា​ទូទៅ​មុខ​របរ​របស់​គេ​មិន​ហុច​ជោគជ័យ​ឱ្យឃើញ ភ្លាមៗ​ទេ​ ។ តែ​បើ​នឹង​ចាប់​កិច្ចការ​អ្វី​មួយ​ហើយ​អ្នក​ដែល​ស្គាល់​គេ​តែង​សរសើរ ព្រម​ទាំង​សង្ឃឹម​លើ​គេ ជា​និច្ច​ ។\n"
            "លុយកាក់ និង ទ្រព្យសម្បត្តិ\n"
            "មនុស្ស​ជំពូក​លេខ​៤​ប្រើ​លុយកាក់​ដោយ​ប្រយ័ត្នប្រយែង​ណាស់​ហើយ​មិន​ស្រប​រកស៊ី​ក្នុង​មុខ​របរ​ណា​ដែល​អាច​មាន​កំហាតបង់​ទេ​ ។ គេ​ចូល​ចិត្ដ​សន្សំ​លុយ​ហើយ​ពូកែ​ទុក​ដាក់​បំផុត​ ។ ស្ថានភាព​ហិរញ្ញវត្ថុ​របស់​គេ​ច្រើន​តែមាំ​ទាំ​ ។ គេ​មិនមែន​ជា​មនុស្ស​កំណាញ់​ទេ​តែ​បើ​នឹង​ចាយ​វាយ​គឺ​គេ​ចាយ តែ​លុយ​ណា​ដែល​គេ​យល់​ថា​អាច​ចាយ​បាន​.";

      case 5:
        return 'មនុស្សជំពួកលេខ ៥\n\n'
            'លក្ខណៈសម្បត្តិ\n'
            'មាន​ទំនោរ​ចិត្ដ​ជា​អ្នក​ស្វា​ហាប់​រហ័សរហួន​ប្រកប​ដោយ ថាមពល​ ។ ​ដោយ​មាន​គំនិត​ផ្សងព្រេង​ជា​និស្ស័យ​មនុស្ស​នេះ​ស្រឡាញ់​សេរីភាព​ណាស់​ហើយ​ដើម្បី​សេរីភាព​មនុស្ស​នេះ​មិន​ញញើត​នឹង​លះបង់​អ្វីៗ​គ្រប់យ៉ាង​ ។ គ្មាន​អ្វី​ដែល​ថា​ធ្វើ​ទៅ​មិន​កើត​សម្រាប់​មនុស្ស​នេះ​ទេ​ហើយ​ការណា​ដែល​គេ​ថា មិន​អាច​ធ្វើ​បាន មនុស្ស​នេះ​ចូល​ចិត្ដ​ធ្វើ​បំ​ផុត​ ។ គឺ​ជា​មនុស្ស​ពិបាក​បំផុត​ហើយ​ ហ៊ាន​ប្រយុទ្ធ​នឹង​គ្រោះថ្នាក់​បំផុត​ដែរ​ ។ គេ​ជា​អ្នក​សុទិដ្ឋិនិយម មាន​កា​រត្រង់ ត្រាប់​ដែល​មិន​អាច​បំបែក​បាន គឺ​គុណសម្បត្ដិ​ទាំង​នេះ ហើយ​ដែល​ញ៉ាំង​ឱ្យ​គេ ពុះពារ​ឧបសគ្គ​គ្រប់បែប​យ៉ាង​បាន​ដោយ​ងាយ ។\n'
            'បុគ្គលភាព\n'
            'ហ៊ាន​អារកាត់​ដោយ​ឥត​រា​រែក គឺ​គេ​ជា​មនុស្ស​ក្នុង​ជំពូក​អ្នក​ដែល​ហ៊ាន​សំរេច កិច្ចការ ដោយមិន​សូវ​គិត​ច្រើន​ ។ គេ​ជា​អ្នក​ប្រកប​ដោយ​គំនិត​ភ្លឺស្វាង និង​ គួរឱ្យ​ទាក់ចិត្ដ​នៅ​ក្នុង​សង្គម​ ។ បើ​និយាយ​ឱ្យ​សាមញ្ញ​គឺ​ស៊ី​ដាច់​គេ​ដាច់​ឯង​តែ​ម្ដង មិត្ដ​ភក្ដិ​ក៏​ច្រើន​អ្នក​សើច​សរសើរ​ក៏​ច្រើន​ទៀត​ ។ ក៏​ប៉ុន្ដែ​ជន​ជំពូក​លេខ​៥ ក៏​ជា​មនុស្ស​មិន​ចេះ​អត់ធ្មត់ ហើយ​ឆាប់​ខឹង​ផង​តែ​គឺ​ជា​គុណវិបត្ដិ​ដែល​អាច​ឱ្យ អធ្យាស្រ័យ​បាន​ព្រោះ​មនុស្ស​នេះ​ចេះ​ធ្វើ​ឱ្យ​គេ​រាប់អាន​ណាស់ ។\n'
            'ស្នេហា និង អាពាហ៏ពិពាហ៏\n'
            'ដោយ​គេ​ជា​អ្នក​ឆ្លាតឆ្លុំ​ក្នុង​រឿង​ស្នេហា​គេ​ច្រើន​បាន​ទទួល​ជោគជ័យ​ជានិច្ច​ ។ គេ​ចូល​ចិត្ដ​រៀបការ​យ៉ាង​ហ៊ឹកហ៊ាក់​ហើយ​ការ​រស់​នៅ​ជា​មួយ​គេ​ច្រើន​តែ​បាន​ជួប ប្រទះ​នឹង​រឿង​ថ្មី​ជានិច្ច​តែ​រឿង​ថ្មី​ទាំង​នេះ​មិនមែន​សុទ្ធ​តែ​ជា​រឿង​សប្បាយ​ទេ ​។ គេ​ត្រូវ​រៀបការ​ជា​មួយ​មនុស្ស​ជំពូក​លេខ​៥​ដូចគ្នា​ហើយ​ការ​រួមរស់​របស់​គេ​ច្រើន​តែ​ជួប​នឹង​រឿង​ថ្មី ហើយ​គ្រោតគ្រាត​បន្ដិច\n'
            'ការងារ និង ទំនាក់ទំនង\n'
            'អ្វីៗ​ដែល​ធ្វើ​ឱ្យ​មនុស្ស​បាន​ទទួល​ជោគជ័យ​ភ្លាមៗ​ដូចជា​ការ​ប៉ិនប្រសប់​ការ​ឈ្លាសវៃ​និង​ការ​វាយឫក​គឺ​សុទ្ធ​តែ​លក្ខណៈ​របស់​មនុស្ស​ជំពូក​លេខ​៥​ទាំង​អស់​ ។ ក៏​ប៉ុន្ដែ ដោយ​ហេតុ​ថា​មនុស្ស​ជំពូក​នេះ​ច្រើន​ជា​អ្នក​រហេចរហាច ខ្វះ​វិន័យ​មនុស្ស​នេះ ច្រើន​ទទួល​ជោគជ័យ​ក្នុង​មុខ​របរ​ណា​ដែល​អាច​ឱ្យ​ខ្លួន​គេ​សំដែង​អំណោយ​ធម្មជាតិ​ព្រម​ទាំង​គំនិត​ផ្ដើម​របស់​គេ​បាន​ ។ គេ​ច្រើន​សង្កេត​ឃើញ​មនុស្ស​ជំពូក​លេខ​៥ ជា​សិល្បករ អ្នក​កាសែត អ្នក​និពន្ធ អ្នក​បើកបរកប៉ាល់ ជាដើម​ ។\n'
            'លុយកាក់ និង ទ្រព្យសម្បត្តិ\n'
            'ចំពោះ​រឿង​លុយកាក់ មនុស្ស​នេះ​ច្រើន​ជួប​ឧបសគ្គ​ ។ ជួន​កាល​គេ​ជា​មហាសេដ្ឋី ជួន​កាល​គេ​ក៏​ក្ររហាមដែរ​ ។ ការ​ពិត​គេ​ជា​អ្នក​ចាយ​ធំ​ហើយ​ចូល​ចិត្ដ​បំពេញ​ចំណូលចិត្ដ​របស់​ខ្លួន​គ្រប់យ៉ាង ដោយ​គ្មាន​ខ្វល់​ថា​រឿង​សប្បាយ​នោះ​នឹង​ឱ្យ​ខ្លួន​គេ​ទៅ​រួច​ឬ​ក៏​ទេ​ឡើយ​ ​មនុស្ស​ជំពូក​នេះ​ឥត​ចេះ​សន្សំ​លុយកាក់​ទាល់​តែ​សោះ​ហើយ​រឿង​រត់​ការ​ប្រឡេមប្រឡំ​ក៏​អត់​ចេះ​ដែរ​ ។';
      case 6:
        return "មនុស្សជំពួកលេខ ៦\n"
            "លក្ខណៈសម្បត្តិ\n"
            "ជា​អ្នក​ប្រកប​ដោយ​អាត្ម័ន​ថ្លៃថ្នូរ​ហើយ​សុចរិត​ ។ គេ​សំគាល់​មនុស្ស​នេះ​បានត្រង់មាន​និស្ស័យ​ខាង​ស្រឡាញ់​យុត្ដិធម៌​និង​កាតព្វកិច្ច​ ។ គេ​ចូល​ចិត្ដ​ធ្វើ​ល្អ​នឹង​អ្នក​ដទៃ​តែ​ចំពោះ​គ្រួសារ​របស់​គេ​វិញ​គេ​ហ៊ាន​លះបង់​គ្រប់​យ៉ាង​ដើម្បី​ផ្គត់ផ្គង់​ ។ គេ​ជា​អ្នក​មាន​មនៈសិការ​ហើយ​គត់មត់​ពិសេស​ចំពោះ​ការ​ណា​ដែល​ទាក់​ទង​ផ្ទាល់​ចំពោះ​ខ្លួន​គេ​ ។ ថ្វី​បើ​គេ​ជា​មនុស្ស​ប្រយ័ត្នប្រយែង​មិន​ងាយ​សំដែង​ឱ្យ​ឃើញ​ការ​រំភើប​របស់​គេ​ក្ដី​ក៏​គេ​រាប់អាន​អ្នក​ផង​ដោយ​រាក់ទាក់​បំផុត ។\n"
            "បុគ្គលភាព\n"
            "គេ​មាន​និស្ស័យ​ជា​អ្នក​ស្ងប់ស្ងៀម​ហើយ​នឹងធឹង​ព្រម​ទាំង​ស្លូតបូត​និង​សោះ​អង្គើយ​ជា​មួយ​នឹង​អាការៈ​ស្ងប់ស្ងៀម​និង​អត់ធ្មត់​ ។ មនុស្ស​ជំពូក​លេខ​៦​ច្រើន​តែ​ធ្វើ​ឱ្យ​អ្នក​ផង​រាប់​អាន​ណាស់​តែ​ក្នុង​ចំណោម​ជន​ខាង​ក្រោយ​នេះ​គ្មាន​ជន​ណា​ម្នាក់​ហ៊ាន​អះអាង​ថា​បាន​ស្គាល់​គំនិត​របស់​មនុស្ស​ឱ្យ​បាន​ច្បាស់​លាស់​ទេ​ ។ ​ការ​ពិត​បើមាន​មនុស្ស​ណា​ហ៊ាន​ប្រព្រឹត្ដ​ធ្វើឱ្យ​ឆ្គាំឆ្គង​លើ​ខ្លួន​ភ្លាម​មនុស្ស​ជំពូក​លេខ​៦​តែង​សំដែង​ប្រតិកម្ម​ដែល​គេ​មិន​អាច​ស្មាន​ទុក ហើយ​មិន​ងាយ​អត់​ឱន​ឱ្យ​មនុស្ស​ដែល​ធ្វើ​អាក្រក់​មក​លើ​ខ្លួន​ទេ​ ។ គេ​ជា​មនុស្ស​ប្រកប​ដោយ​ឧត្ដមគតិ ឆាប់​រំភើប ដឹង​ហេតុការណ៍​មុន​ជា​និច្ច ក៏​ប៉ុន្ដែ​ក្នុង​ជីវិត​របស់​ខ្លួន មនុស្ស​នេះ​ច្រើន​ជួប​ការ​ខក​ចិត្ដ​ណាស់ ។\n"
            "ស្នេហា និង អាពាហ៏ពិពាហ៏\n"
            "មនុស្ស​ជំពូក​លេខ​៦​មិន​ងាយ​ដាក់​ចិត្ដ​ស្រឡាញ់​គេ​ផ្ដេស​ផ្ដាស​ទេ​តែ​បើ​បាន​ជា​ចាប់​ចិត្ដ​ស្រឡាញ់​ហើយ​គឺ​ស្លាប់​ទៅ​យក​ទៅ​ផង​ ។ បើ​បាន​ជា​រៀបការ​នឹង​អ្នក​ណា​មួយ​ហើយ​មនុស្ស​នេះ​ថ្នាក់ថ្នម​គេ​គ្រប់​បែប​យ៉ាង ហើយ​មិន​ព្រម​ឱ្យ​គូស្រករ​រវើរវាយ​ក្រៅ​ពី​ខ្លួន​ទេ​ ។ គំនិត​ចង់​បាន​តែ​ម្នាក់​ឯង​នេះ​ជា​ការ​មួយ​មិន​គួរគាប់​ទេ​ប៉ុន្ដែ​គូ​ស្រករ​មិន​ខ្នះ​ចិត្ដ​បាន​ឡើយ​ព្រោះ​គេ​ចេះ​ថ្នាក់ថ្នម​និង​ស្រស់ស្រាយ​បំផុត​ ។ បើ​រៀបការ​ជាមួយ​មនុស្ស​ជំពូក​លេខ​៦​ដូច​គ្នា គឺ​ល្អ​ណាស់​ ។ ជា​មួយលេខ​១ក៏​បាន តែ​ត្រូវ​លេខ​១ សុខ​ចិត្ដ​ឱ្យ​លេខ៦​ដឹកនាំ​ត្រួតត្រា​ទើបបាន​ ។\n"
            "ការងារ និង ទំនាក់ទំនង\n"
            "មនុស្ស​ជំពូក​លេខ​៦​មិន​សូវ​ជា​អ្នក​មាន​ចិត្ដ​លោភ​ទេ​អ៊ីចឹង​ហើយ​បាន​គេ​កើត​មក​មិនពូកែ​ខាង​ការ​ជជែក​វែកញែក​ដែល​ត្រូវ​ការ​ឱ្យ​មាន​គំនិត​ផ្ដួច​ផ្ដើម​និង​បញ្ចេញ​បញ្ចូល​ ។ បំណង​ខាង​បញ្ហា​មនុស្ស​តែង​ជំរុញ​មនុស្ស​នេះ​ឱ្យ​ចូល​ចិត្ដ​ធ្វើ​ការ​ណា​ដែល​ទាក់ទង​នឹង​សង្គម​ដូចជា​គ្រូពេទ្យ​ឧបការីសង្គម​និង​សាស្ដ្រាចារ្យ​ជាដើម​ ។ និយាយ​ឱ្យ​ចំទៅ មនុស្ស​ជំពូក​នេះ​កើត​មក​សម្រាប់​តែ​ទទួល​ជោគជ័យ​ក្នុង​វិជ្ជាជីវៈ​ណា​ដែល​ត្រូវ​ការ​ការ​ព្យាយាម ការ​ស្លូតបូត និង​គំនិត​លះបង់ ​។\n"
            "លុយកាក់ និង ទ្រព្យសម្បត្តិ\n"
            "គេ​មិន​សូវ​ឃើញ​មនុស្ស​ជំពូក​លេខ​៦​នេះ​មាន​ទ្រព្យ​ជា​ដុំ​កំភួន​ទេ​ព្រោះ​មនុស្ស​នេះ​គ្មាន​ចិត្ដ​ស្រេក​ឃ្លាន​ចង់​មាន​ចង់​បាន​ឡើយ​មាន​ប៉ុន្មាន​ស៊ី​ប៉ុណ្ណឹង​ ។ ​គេ​មិនមែន​ជា​អ្នក​ចាយ​វាយ​ធំ​ទេ​ប៉ុន្ដែ​គេ​ក៏​មិន​ឱ្យ​តម្លៃ​ធំ​ទៅ​លើ​រឿង​លុយកាក់​ដែរ​.";

      case 7:
        return "មនុស្សជំពូកលេខ ៧\n"
            "លក្ខណៈសម្បត្តិ\n"
            "មាន​ប្រាជ្ញា​ឆ្លាត​ឆ្លុំ​ឆាប់​យល់​មិន​ងាយ​ជឿ​រឿង​អ្វី​មួយៗ ដោយ​ងាយ​ទេ​ ។ បើ​នឹង​ជឿ​លុះ​ណា​តែ​បាន​ពិចារណា​បាន​ដិតដល់​ណាស់​ ។ គេ​មិន​ចូល​ចិត្ដ​ការងារ​ណា​ដែល​មិន​ស្រប​នឹង​គំនិត​ប្រាជ្ញា​របស់​គេ​ទេ​ ।\n"
            "បុគ្គលភាព\n"
            "ជា​អ្នក​ម៉ឺង​ម៉ាត់​ បើ​នឹង​អារកាត់​រឿង​អ្វី​មួយ​គេ​ច្រើន​តែ​ធ្វើ​ឡើង​ដោយ​វិចារណញ្ញាណ​គឺ​មិនមែន​ដោយ​ផ្លូវ​ចិត្ដ​ទេ​ ។ គេ​ជា​មិត្ដភក្ដិ​ម្នាក់​ចេះ​ស្គាល់​ទុក្ខធុរៈ​ចេះ​យោគយល់​គ្នា​ទៅ​វិញ​ទៅ​មក​មិន​ងាយ​ប្រកាន់​ខឹង​តែ​បើ​បាន​ជា​ប្រកាន់​ខឹង​ហើយ​ក៏​មិន​ងាយ​ជានា​វិញ​ដែរ​ ។ គេ​ជា​មនុស្ស​គួរ​ឱ្យ​ទុក​ចិត្ដ​រាប់អាន​បាន​ព្រោះ​មិន​ចូល​ចិត្ដ​ផ្ដល់​ទុក្ខ​ឱ្យ​អ្នក​ដទៃ​ ។\n"
            "ស្នេហា និង អាពាហ៏ពិពាហ៏\n"
            "ដោយ​គេ​ជា​មនុស្ស​មាន​ប្រាជ្ញា​គេ​មិន​សូវ​ខក​ចិត្ដ​ក្នុង​រឿង​គូស្រករ​ទេ​គេច្រើន​រើស​បាន​គូគាប់​ស្រប​តាម​សេចក្ដី​ប្រាថ្នា​របស់​គេ​ ។ ​គេ​មិន​ចូលចិត្ដ​រើស​គូ​ស្រករ​ណា​ដែល​មិន​ឆ្លាតឆ្លុំ​ឡើយ​ ។ ​យក​ល្អ​ត្រូវ​រៀប​ការ​ជា​មួយ​នឹង​មនុស្ស​ជំពូក​លេខ​៩ និង​លេខ​៤​ព្រោះ​ប្រាជ្ញា និង​ចិត្ដ​ជា​អ្នក​មនុស្ស​និយម​មាន​ស្រប​គ្នា​ ។ មិន​គួរ​រៀបការ​ជា​មួយ​មនុស្ស​ជំពូក​លេខ​១​ទេ ព្រោះ​ច្រើន​ទាស់​ទែង​គ្នា​ ។\n"
            "ការងារ និង ទំនាក់ទំនង\n"
            "មនុស្ស​នេះ​ចូល​ចិត្ដ​ស្រឡាញ់​ការងារ​ណា​ដែល​ប្រើ​ប្រាជ្ញា​ ។ គេ​ច្រើន​ជា​សង្គម​វិទូ សិល្បករ មេធាវី រដ្ឋបាល ឬ​ពាណិជ្ជករ​ ។ ជា​ទូទៅ ក្នុង​មុខ​របរ​គេ​ច្រើន​​បានទទួល​ជោគជ័យ​រហ័ស​ណាស់​ ។\n"
            "លុយកាក់ និង ទ្រព្យសម្បត្តិ\n"
            "គេ​មិន​ជា​អ្នក​ចាយ​ធូរ តែ​ក៏​មិន​ជា​អ្នក​កំណាញ់​ដែរ​ ។ កិច្ច​ការ​ណា​ត្រូវ​ចាយ​ទើប​គេ​ចាយ​ ។ និយាយ​ឱ្យ​ខ្លី​ទៅ គឺ​គេ​ចេះ​ចាយ​មាន​មុខ​មាន​បែប​ ។ គេ​មិន​សូវ​ជួប​ប្រទះ​នឹង​រឿង​ទាល់​លុយកាក់​ទេ​ហើយ​ក៏​ច្រើន​ហ៊ាន​ចាយ​វាយ​ជួយ​មិត្ដភក្ដិ​ដែល​ជួប​ប្រទះ​នឹង​ការ​លំបាក​ផ្នែក​ហិរញ្ញវត្ថុ​ទៀត​ផង​។";

      case 8:
        return 'មនុស្សជំពួកលេខ ៨\n\n'
            'លក្ខណៈសម្បត្តិ\n'
            'ជា​មនុស្ស​ប្រកប​ដោយ​កំលាំង​ខាង​ឆន្ទៈ​រក​មិន​បាន ហើយ​មាន​ចរិត​រឹង​ដូច​ដែក​ ។ ទុក​ចិត្ដ​ខ្លួន​ឯង​ណាស់​ហើយ​បើ​នឹង​កាន់​ការ​អ្វី​មួយ​ហើយ​គឺ​ធ្វើ​ឱ្យ​ទាល់​តែ​បាន សំរេច​ទើប​សុខ​ចិត្ដ​ ។ មិន​ចេះ​សំ​លុត​គេ​ហើយ​បើ​ជួប​ប្រទះ​នឹង​ការ​ពិបាក​អ្វី​មួយ​នៅ​ពេល​កំពុង​ចង់ សំរេច​បំណង​អ្វី​មួយ​ហើយ​មនុស្ស​នេះ​ឥត​ចេះ​រា​ថយ​ឬ​ក៏​ខក​ចិត្ដ​ទេ​គឺ​ពុះពារ​ទាល់ តែបាន​ដល់​គោល​ដៅ​ ។ ជា​ទូទៅ​គឺ​ជា​មនុស្ស​ស្អប់​ការ​ខ្ជីខ្ជា​ហើយ​ចរិត​នេះ​សោត ទៀត​តែង​នាំ​មនុស្ស​នេះ​ឱ្យ​បាន​ជួប​ជួន​ជោគជ័យ​ជួន​ធ្លាក់​ទឹក​ ។ ប៉ុន្ដែ​ទោះ​ជា​យ៉ាង​ណា​ក៏​មិន​ចេះ​រារែក​ដែរ ។\n'
            'បុគ្គលភាព\n'
            'គេ​ជា​មនុស្ស​មាន​គំនិត​ប្រយុទ្ធ​ហើយ​ស្វាហាប់​ហ៊ាន​ត​ស៊ូ​យ៉ាង​ពេញ​ទំហឹង​ដើម្បី ការពារ​ឧត្ដមគតិ​ដែល​ខ្លួន​ជឿ​ថា​ល្អ​ ។ មាន​ចិត្ដ​លោភ​លន់​ហើយ​ស្វិតស្វាញ​ ។ បើ​ចង់​សំរេច​គោល​បំណង​អ្វី​មួយ​ហើយ​មនុស្ស​លេខ​៨​សុខ​ចិត្ដ​លះ​បង់​គោល បំណង​ដទៃ​ទៀត​ចោល​សិន ដើម្បី​ធ្វើ​គោល​បំណង​នេះ​ឱ្យ​ទាល់​តែ​បាន​សំរេច​ ។ អ៊ី​ចឹង​ហើយ បាន​ជា​មាន​អ្នក​ចូល​ចិត្ដ​រាប់​អាន​គេ​ច្រើន​ណាស់ ។\n'
            'ស្នេហា និង អាពាហ៏ពិពាហ៏\n'
            'ក្នុង​រឿង​ស្នេហា​មនុស្ស​ជំពូក​លេខ​៨ ច្រើន​ប្រែប្រួល​មិន​នឹង​ហ្ន​ទេ​ ។ មាន​ម្ង៉ៃ​ថ្នាក់ថ្នម​គូគាប់​មាន​ម្ង៉ៃ​ទៀត​បែប​រៀង​គេចៗ​ហើយ​បែប​វាហី​ ។ ដោយ​ហេតុ​មនុស្ស​នេះ​មាន​ចរិត​ពិបាក​បែប​នេះ​មនុស្ស​ជំពូក​លេខ​៨ ត្រូវ​រក គូ​ស្រករ​ណា​ដែល​ចេះ​យល់​ខ្លួន​ចេះអត់​ឱន​ចំពោះ​ទឹកមុខ​ប្រែប្រួល​គ្មាន​ឈប់ឈរ របស់​ខ្លួន​ ។ ​ជាទូទៅគួរ​រៀបការ​ជា​មួយ​មនុស្ស​ជំពូក​លេខ២​ ។ ការ​ពិត​ភាព​ស្រស់​ស្រាយ និង​ចិត្ដ​សន្ដោស​របស់​មនុស្ស​លេខ​២​តែង​មាន​ជោគ ជ័យ​លើ​ភាព​ជា​អ្នក​ជិះជាន់​របស់​មនុស្ស​ជំពូក​លេខ​៨ ។\n'
            'ការងារ និង ទំនាក់ទំនង\n'
            'ដោយ​ហេតុ​មាន​និស្ស័យ​ខាង​គំនិត​បង្កើត​ច្រើន និង​ប្រកប​ដោយ​ថាមពល អស្ចារ្យ​ទៀត​នោះ​មនុស្ស​ជំពូក​លេខ​៨​ត្រូវ​វាសនា​ចារ​មក​ឱ្យ​បាន​ទទួល​ជោគជ័យ​ក្នុង​កិច្ចការ​សព្វ​សារពើ​ ។ តែ​ធ្វើ​អ្វី​ហើយ​គឺ​ធ្វើ​ដោយ​មធ្យ័ត​បំផុត​ \n'
            'លុយកាក់ និង ទ្រព្យសម្បត្តិ\n'
            'គេ​ជា​មនុស្ស​ពូកែ​ខាង​យក​លុយ​ទៅ​រកស៊ី​ណាស់​ ។ ​ទោះ​ជា​សម្បត្ដិ​ទ្រព្យ​របស់ មាន​ធំ​ឬ​តូច​ក៏​ដោយ​ឱ្យ​តែ​គេ​ប្រកប​របរ​គេ​មិន​ងាយ​ខូច​ខាត​លុយ​កាក់​ទេ​ ។ មនុស្ស​ធំៗ ជា​ច្រើន​ដែល​ស្ថិត​នៅ​ក្នុង​ជំពូក​មនុស្ស​លេខ​៨​នេះ ច្រើន​រក ទ្រព្យសម្បត្ដិ​បាន​ស្ដុកស្ដម​ណាស់ ដោយ​ចាប់​រកស៊ី​ពី​គ្មាន​មួយ​សេន​ទៅ ។';
      case 9:
        return "មនុស្សជំពូកលេខ ៩\n"
            "លក្ខណៈសម្បត្តិ\n"
            "គឺ​ជា​មនុស្ស​ប្រកប​ដោយ​ភាព​រំភើប​ដ៏​ជ្រាលជ្រៅ​និង​មនុស្ស​ធម៌​ដ៏​អស្ចារ្យ​ ។ ជា​មនុស្ស​ចិត្ដ​ល្អ​ណាស់​ឱ្យ​តែ​មាន​គេ​មក​សុំ​ជំនួយ​ភ្លាម​គឺ​ជួយ​គេ​ដោយ​ឥឥត​គិត​ផល​ប្រយោជន៍​ទេ​ ។ គេ​ជា​អ្នក​ឧត្ដមគតិ​និយម​ផង​ប្រលោម​និយម​ផង​អញ្ចឹង​ហើយ​បាន​ជា​គេ​ជា​មនុស្ស​ចូល​ចិត្ដ​មើល​ឃើញ​អ្នក​ដទៃ​ល្អ​ហើយ​ស្មោះ​ត្រង់​ ។ គឺ​គេ​ទុក​ចិត្ដ​លើ​មនុស្ស​ដោយ​ឥឥត​រើស​មុខ​ ។\n"
            "បុគ្គលភាព\n"
            "ដោយ​ហេតុ​គេ​មាន​និស្ស័យ​ស្រស់ស្រាយ​ហើយ​ចូលចំណោម​ចុះ​នោះ​មនុស្ស​ជំពូក​លេខ​៩​តែង​មាន​មិត្ដភក្ដិ​ច្រើន​ក៏​ប៉ុន្ដែ​គេ​ក៏​តែង​ឃើញ​មនុស្ស​នេះ​មាន​សត្រូវ​ខ្លះ​ដែរ​ ។ ជា​ការ​ផ្ទុយ​ដែល​ជួន​កាល​មនុស្ស​នេះ​មាន​ប្រតិកម្ម​បែប​ជា​អ្នក​ការទូត​ឬ​ក៏​មិន​និយាយ​ការ​ពិត​ប្រាប់​គេ​ឯង​ ។ មិន​ជា​អ្នក​ម៉ត់ចត់​ទេ តែ​ទោះ​ជា​យ៉ាង​ណា​ក៏​មនុស្ស​នេះ​ច្រើន​តែ​ធ្វើ​ឱ្យ​គេ​មាន​ សមាន​ចិត្ដ​មក​លើ​ខ្លួន​ជា​និច្ច​ ។\n"
            "ស្នេហា និង អាពាហ៏ពិពាហ៏\n"
            "ជា​អ្នក​មាន​ចិត្ដ​ស្មោះត្រង់​ក្នុង​ស្នេហា គឺ​ជា​គូ​ស្រករ​ដ៏​ឧត្ដម ថ្វី​បើ​ពេល​ខ្លះ​មនុស្ស​ជំពូក​នេះ​មិន​រវីរវល់​នឹង​ការ​ថ្នាក់ថ្នម​គ្រួសារ​ព្រោះ​តែ​ខ្លួន​ជាប់​រវល់​នឹង​ប្រយោជន៍​ដ៏​ច្រើន​ហើយ​ប្លែក​ក្ដី​ ។ យក​ល្អ​មនុស្ស​ជំពូក​លេខ​៩​ត្រូវ​រៀប​ការ​ជា​មួយ​មនុស្ស​ជំពូក​លេខ​៩ ដូចគ្នា លេខ​៧ ឬ​លេខ​៤​ ។ គូ​ស្រករ​បែប​នេះ​ស្គាល់​សុខ​ទុក្ខ​គ្នា​ណាស់ ដោយ​ហេតុ​មាន​គំនិត និង​ប្រយោជន៍​រួម​ជា​មូលដ្ឋាន​ ។\n"
            "ការងារ និង ទំនាក់ទំនង\n"
            "មនុស្ស​ជំពូក​លេខ​៩ ចូល​ចិត្ដ​តែ​ការងារ​ណា​ដែល​នាំ​ឱ្យ​អាច​រស់​នៅ​ជា​មួយ​អ្នក​ផង​បាន​រហូត​ព្រោះ​មនុស្ស​ជំពូក​នេះ​ចូលចិត្ដ​ទាក់ទង​នឹង​ធ្វើ​សហការ​ជាមួយ​អ្នក​ដទៃ​ណាស់​ ។ គេ​ច្រើន​តែ​ធ្វើ​ជា​ចៅ​ក្រម មេធាវី គ្រូពេទ្យ ឬ​សាស្ដ្រាចារ្យ​ ។ យក​ល្អ​មនុស្ស​ជំពូក​លេខ​៩ គួរ​កាន់​កាប់​មុខ​របរ​ទាំង​នេះ​ ។\n"
            "លុយកាក់ និង ទ្រព្យសម្បត្តិ\n"
            "ក្នុង​រឿង​រក​លុយ​កាក់ មនុស្ស​ជំពូក​លេខ​៩​មិន​ពូកែ​ទាល់​តែសោះ​ ។ ​តែ​គេ​ច្រើន​ជា​មនុស្ស​មាន​សំណាង​ក្នុង​រឿង​រក​លុយ​កាក់​ទៅ​វិញ ហើយ​ជា​មនុស្ស​ចិត្ដ​ល្អ​ចំពោះ​អ្នក​ខ្វះ​ខាត​ ។";

      default:
        return 'No fortune found.';
    }
  }

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('ទាយ​ឈ្មោះ​ឡាតាំង'),
      ),
      body: SingleChildScrollView(
        padding: EdgeInsets.all(16.0),
        child: Card(
          elevation: 4.0,
          shape: RoundedRectangleBorder(
            borderRadius: BorderRadius.circular(12.0),
          ),
          child: Padding(
            padding: EdgeInsets.all(16.0),
            child: Column(
              mainAxisSize: MainAxisSize.min,
              children: <Widget>[
                Text(
                  'បញ្ចូលឈ្មោះអ្នកជាអក្សរឡាតាំង:',
                  style: TextStyle(fontSize: 18, fontWeight: FontWeight.bold),
                ),
                SizedBox(height: 20),
                TextField(
                  controller: _controller,
                  decoration: InputDecoration(
                    border: OutlineInputBorder(
                      borderRadius: BorderRadius.circular(8.0),
                    ),
                    labelText: 'ឈ្មោះឡាតាំង',
                    contentPadding: EdgeInsets.symmetric(horizontal: 16.0),
                  ),
                ),
                SizedBox(height: 20),
                ElevatedButton(
                  onPressed: _getFortune,
                  child: Text('ទស្សន៍ទាយ'),
                  style: ElevatedButton.styleFrom(
                    shape: RoundedRectangleBorder(
                      borderRadius: BorderRadius.circular(8.0),
                    ),
                    padding:
                        EdgeInsets.symmetric(vertical: 12.0, horizontal: 20.0),
                  ),
                ),
                SizedBox(height: 20),
                Text(
                  _fortune,
                  style: TextStyle(fontSize: 16),
                  textAlign: TextAlign.center,
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }
}

void main() {
  runApp(MaterialApp(
    home: NamePredictionPage(),
    theme: ThemeData(
      primarySwatch: Colors.blue,
    ),
  ));
}
